app/Services/BookService.php

SELECT * FROM `books`
SELECT * FROM `genres` WHERE `genres`.`id` in (2, 6, 8)
SELECT * FROM `publishers` WHERE `publishers`.`id` in (2, 3, 8, 10)
SELECT `authors`.*, `book_author`.`book_id` as `pivot_book_id`, `book_author`.`author_id` as `pivot_author_id` FROM `authors` inner join `book_author` on `authors`.`id` = `book_author`.`author_id` WHERE `book_author`.`book_id` in (1, 2, 3, 4, 5, 6)
---
    public function getAllBooks(): Collection
    {
        return Book::with('genre','authors','publisher')
            ->get();

SELECT * FROM `books` ORDER BY `created_at` DESC LIMIT 1
SELECT * FROM `genres` WHERE `genres`.`id` in (8)
SELECT * FROM `publishers` WHERE `publishers`.`id` in (3)
SELECT `authors`.*, `book_author`.`book_id` as `pivot_book_id`, `book_author`.`author_id` as `pivot_author_id` FROM `authors` inner join `book_author` on `authors`.`id` = `book_author`.`author_id` WHERE `book_author`.`book_id` in (5)
---
    public function newReleaseBook() : Book
    {
        return Book::with('genre','authors','publisher')
            ->latest('created_at')
            ->first();

SELECT * FROM `books` LIMIT 6
SELECT * FROM `genres` WHERE `genres`.`id` in (2, 6, 8)
SELECT * FROM `publishers` WHERE `publishers`.`id` in (2, 3, 8, 10)
SELECT `authors`.*, `book_author`.`book_id` as `pivot_book_id`, `book_author`.`author_id` as `pivot_author_id` FROM `authors` inner join `book_author` on `authors`.`id` = `book_author`.`author_id` WHERE `book_author`.`book_id` in (1, 2, 3, 4, 5, 6)
---
    public function limitBook() : Collection
    {
        return Book::with('genre','authors','publisher')
            ->limit(6)
            ->get();