app/Livewire/Rating/Rating.php

SELECT * FROM `reviews` WHERE `reviews`.`book_id` = 1
---
    public function render(): Application|Factory|\Illuminate\Contracts\View\View|View
    {
        return view('rating.rating',['rating' => $this->book->reviews()->avg('ratings')]);