app/Http/Controllers/HomeController.php

SELECT * FROM `inventory` WHERE `inventory`.`book_id` = 5 and `inventory`.`book_id` IS not NULL LIMIT 1
---
    public function index()
    {
        $book = $this->bookService->newReleaseBook('inventorys');
        return view('Home.index',[
            'book' => $book,
            'price' => $book->inventorys()->first()->price